src/InformationRegisters/ПараметрыКластераБуфер/ПараметрыКластераБуфер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКластераБуфер</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиМинутаUTC</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПараметрыКластераБуфер/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

// Процедура - Записать данные
//
// Параметры:
//  Тип    - Строка - Тип данных (ПРП - параметры рабочих процессов, ПСНС - параметры сеансов, ПЛИЦ - параметры лицензий).
//  Данные - Строка - Строка данных в формате JSON.
//
Процедура ЗаписатьДанные(Тип, Данные, УникальныйИдентификаторКластера = Неопределено) Экспорт
    
    ТекДата = ТекущаяУниверсальнаяДата();
    ТекДатаМинута = НачалоМинуты(ТекДата);
    
    НаборЗаписей = СоздатьНаборЗаписей();
    
    НовСтрока = НаборЗаписей.Добавить();
    НовСтрока.Тип = Тип;
    НовСтрока.ДатаЗаписиМинутаUTC = ТекДатаМинута;
    НовСтрока.УникальныйИдентификаторЗаписи = Новый УникальныйИдентификатор;
    НовСтрока.Данные = Данные;
    НовСтрока.УникальныйИдентификаторКластера = УникальныйИдентификаторКластера;
    
    НаборЗаписей.Записать(Ложь);
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
